app/controllers/api/v1/drugstore_controller.rb

  def index
    @drugstores = Drugstore.all
    render json: {
      data: @drugstores.map {|drugstore|
---
SELECT "drugstores".* FROM "drugstores"

  def edit
    @drugstore = Drugstore.find_by(id: params[:id])
---
SELECT "drugstores".* FROM "drugstores" WHERE "drugstores"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def update

    if  @drugstore.update(name: params[:name])
---
UPDATE "drugstores" SET "name" = $1, "updated_at" = $2 WHERE "drugstores"."id" = $3  [["name", "Better io"], ["updated_at", "2021-08-11 03:49:17.177755"], ["id", 1]]