app/controllers/api/v1/masks_controller.rb

  def edit

    @drugstore = Drugstore.find_by(name: params[:name])
    @masks = Drugstore.find_by(name: params[:name]).masks
    render json:{
      name: @drugstore.name,
      data: @masks.map { |mask|
---
SELECT "drugstores".* FROM "drugstores" WHERE "drugstores"."name" = $1 LIMIT $2  [["name", "Better You"], ["LIMIT", 1]]
SELECT "drugstores".* FROM "drugstores" WHERE (2) LIMIT $1  [["LIMIT", 1]]
SELECT "masks".* FROM "masks" INNER JOIN "drugstores_masks" ON "masks"."id" = "drugstores_masks"."mask_id" WHERE "drugstores_masks"."drugstore_id" = $1  [["drugstore_id", 1]]

  def update
    @mask = Mask.find(params[:id])
    if @mask.update(mask_name: params[:mask_name], price: params[:price])
---
SELECT "masks".* FROM "masks" WHERE "masks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "masks" SET "mask_name" = $1, "price" = $2, "updated_at" = $3 WHERE "masks"."id" = $4  [["mask_name", "Black_mask"], ["price", "9.99"], ["updated_at", "2021-08-11 06:26:36.397251"], ["id", 1]]

  def destroy
    @mask = Mask.find_by(mask_name: params[:mask_name])
    @mask.destroy
---
SELECT "masks".* FROM "masks" WHERE "masks"."mask_name" = $1 LIMIT $2  [["mask_name", "kkl"], ["LIMIT", 1]]
DELETE FROM "masks" WHERE "masks"."id" = $1  [["id", 6]]