app/controllers/api/v1/masks_controller.rb

SELECT "masks".* FROM "masks" WHERE "masks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @mask = Mask.find(params[:id])