app/controllers/api/v1/searches_controller.rb

  def create
    @search = Search.create(min_price: params[:min_price], max_price: params[:max_price])
    render json: {
      data: @search.search_masks_price.each { |mask|
---
INSERT INTO "searches" ("min_price", "max_price", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["min_price", "10.0"], ["max_price", "30.0"], ["created_at", "2021-08-11 11:17:19.015290"], ["updated_at", "2021-08-11 11:17:19.015290"]]
SELECT "masks".* FROM "masks" WHERE (price >= 10.0) AND (price <= 30.0)